// emojisData.js

const emojisData = [
    {
      category: 'Faces',
      emojis: ['😀', '😁', '😂', '🤣', '😃', '😄', '😅', '😆', '😉', '😊']
    },
    {
      category: 'Gestures',
      emojis: ['👍', '👎', '👊', '✊', '✋', '🤟', '🤞', '🤘', '👌', '🤏']
    },
    {
      category: 'Animals',
      emojis: ['🐶', '🐱', '🐭', '🐹', '🐰', '🦊', '🐻', '🐼', '🐨', '🐯']
    },
    {
      category: 'Birds',
      emojis: ['🦅', '🦆', '🦉', '🦢', '🦜', '🦚', '🦩', '🦢', '🦤', '🦩']
    },
    {
      category: 'Vehicles',
      emojis: ['🚗', '🚕', '🚙', '🚌', '🚎', '🏎️', '🚓', '🚑', '🚒', '🚐']
    },
    {
      category: 'Foods',
      emojis: ['🍎', '🍐', '🍊', '🍋', '🍌', '🍉', '🍇', '🍓', '🥝', '🍒']
    },
    {
      category: 'Activities',
      emojis: ['⚽', '🏀', '🏈', '⚾', '🎾', '🏐', '🏓', '🏸', '🥊', '🥋']
    },
    {
      category: 'Hearts',
      emojis: ['❤️', '🧡', '💛', '💚', '💙', '💜', '🖤', '💖', '💝', '💘']
    },
    {
      category: 'Flags',
      emojis: ['🏳️', '🏴', '🏁', '🚩', '🏳️‍🌈', '🇺🇳', '🎌', '🇪🇺', '🇦🇺', '🇧🇪']
    },
    // Add more categories and emojis as needed
  ];
  
  export default emojisData;
  